Tekla Open API Reference for Tekla Structures 2025
SectionMark Constructor (View, Point, Point)
 Creates a new section mark instance with the given positions.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SectionMark(
	View view,
	Point leftPoint,
	Point rightPoint
)
Public Sub New (
	view As View,
	leftPoint As Point,
	rightPoint As Point
)
Parameters
view
Type: Tekla.Structures.Drawing.View
The view to be used.
leftPoint
Type: Tekla.Structures.Geometry3d.Point
The starting point of the left side of the new section mark.
rightPoint
Type: Tekla.Structures.Geometry3d.Point
The starting point of the right side of the new section mark.
See Also
Reference
SectionMark Class
SectionMark Overload
Tekla.Structures.Drawing Namespace